Repository: allnes/parallel_programming_course
Catalog: docs/locale/*/LC_MESSAGES/common_information/points.po
Languages: ru

source: Points
ru: Балльно-рейтинговая система

source: For “process parallelism” semester
ru: Для семестра, где студенты изучают параллелизм на процессах

source: 1st MPI task
ru: Первая MPI задача

source: Solution
ru: Решение

source: 2nd MPI task
ru: Вторая MPI задача

source: Performance
ru: Производительность

source: 3rd MPI task
ru: Третья MPI задача

source: **Total : 60 points**
ru: **Итог : 60 баллов**

source: For “thread parallelism” semester
ru: Для семестра, где студенты изучают параллелизм на потоках

source: Sequential version
ru: Последовательная версия

source: OpenMP version
ru: OpenMP версия

source: TBB version
ru: TBB версия

source: std::thread version
ru: std::thread версия

source: “MPI + threads” version (The threading technology is chosen randomly)
ru: “MPI + threads” версия (Технология параллелизма на потоках будет выбрана случайным образом)

source: **Total : 54 points**
ru: **Итог : 54 балла**

source: Report
ru: Отчет

source: Completeness
ru: Наличие всех требуемых пунктов

source: Text Quality
ru: Качество текста

source: Formatting Quality
ru: Качество оформления

source: Total
ru: Итог

source: Conversion of points into exam assessment or pass/fail
ru: Перевод баллов в экзаменационную оценку или зачет/незачет

source: For 5-point grading system
ru: 5-ти балльная система оценки

source: Points range
ru: Диапозон баллов

source: Exam Assessment
ru: Экзаменационная оценка

source: Student Pass
ru: Зачет

source: Passed
ru: Зачет

source: Not Passed
ru: Незачет

source: For 7-point grading system **(our current system)**
ru: 7-ми балльная система оценки **(наша текущая система)**

source: Penalties:
ru: Штрафные санкции

source: A deadline will be set for each version.
ru: Для каждой версии будет установлен свой крайний срок сдачи.

source: 1 point is deducted from the version’s score for each day of delay in submission.
ru: За каждый день просрочки из оценки версии вычитается 1 балл

source: The task is considered submitted when it is merged into the master/main branch.
ru: Задание считается выполненным, когда оно попал в master/main ветку.

source: The submission time is defined as the timestamp of the last commit that successfully passes the CI pipeline.
ru: Фиксированное время сдачи работы определяется как время последнего коммита, который успешно прошел CI.

source: Comments:
ru: Комментарии

source: It is forbidden to write the report if all tasks are not completed.
ru: Запрещено писать отчет, если не выполнены все задания, которые связаны с этим отчетом.

source: Please keep in mind that one week before the end of the semester, the repository will be closed for final assessment.
ru: Просьба иметь ввиду, что за неделю до конца семестра репозиторий будет закрыт для подведения окончательных итогов.
